HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
/***********************************************************************************************************************
* Copyright (c) 2014 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
***********************************************************************************************************************/
/***********************************************************************************************************************
* System Name  : FLASH SPI driver software
* File Name    : r_flash_spi.c
* Version      : 3.51
* Device       : -
* Abstract     : User I/F file
* Tool-Chain   : -
* OS           : not use
* H/W Platform : -
* Description  : SPI FLASH User I/F file
* Limitation   : None
***********************************************************************************************************************/
/***********************************************************************************************************************
* History      : DD.MM.YYYY Version  Description
*              : 23.07.2014 2.21     Created
*              : 29.05.2015 2.32     Revised functions of same as Ver.2.32 of EEPROM SPI FIT module.
*              : 10.12.2020 3.02     Modified comment of API function to Doxygen style.
*              : 16.03.2023 3.20     Added support for AT25QF641B-SHB with Indirect Access Mode of QSPIX
*              : 15.11.2023 3.40     Removed note for QSPIX Memory Mapped Mode in R_FLASH_SPI_Read_Data() function.
*                                    Updated according to GSCE Code Checker 6.50.
*                                    Added support for MX25U6432F.
*                                    Added features Advanced sector protection supporting for MX66L1G45 and MX25U6432F.
*              : 20.12.2024 3.50     Modified comment of API function to Doxygen style.
*              : 15.03.2025 3.51     Updated disclaimer.
***********************************************************************************************************************/


/************************************************************************************************
Includes <System Includes> , "Project Includes"
*************************************************************************************************/
#include "r_flash_spi_if.h"                      /* FLASH driver I/F definitions                 */
#include "r_flash_spi_config.h"                  /* FLASH driver Configuration definitions       */
#include "r_flash_spi_private.h"                 /* FLASH driver Private module definitions      */

/************************************************************************************************
Macro definitions
*************************************************************************************************/


/************************************************************************************************
Typedef definitions
*************************************************************************************************/


/************************************************************************************************
Exported global variables (to be accessed by other files)
*************************************************************************************************/
#if (FLASH_SPI_CFG_LONGQ_ENABLE == 1)
static longq_hdl_t       p_flash_long_que;             /* LONGQ handler                        */
#endif  /* (FLASH_SPI_CFG_LONGQ_ENABLE == 1) */


/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Open
 *****************************************************************************************************************/ /**
 * @brief This function is run first when using the APIs of the serial flash memory control software.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @details   Initializes the slave device select pin of the device number specified by the argument devno.
 *            After initialization the pin is in the general output port high-output state.\n
 *            Do not call this function when communication is in progress.
 *            Communication cannot be guaranteed if the function is called when communication is in progress.
 * @note      After calling this user API function, it is recommended that R_FLASH_SPI_Polling() be used to confirm
 *            that the serial flash memory write cycle has completed. The next read or write processing will not be
 *            accepted while the serial flash memory write cycle is in progress.\n
 *            However, it is possible to access the serial flash memory during the write cycle by, for example,
 *            issuing a system reset while the serial flash memory write cycle is in progress and restarting
 *            serial flash memory control from the beginning.
 */
flash_spi_status_t R_FLASH_SPI_Open(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_init_port(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Open
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Close
 *****************************************************************************************************************/ /**
 * @brief This function is used to close the serial flash memory control software when it is in use.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_OTHER  Other error
 * @details   Sets the slave device select pin of the device number specified by the argument devno to function as
 *            a general I/O port. After the function runs, the pin is in the general output port high-output state.\n
 *            Do not call this function when communication is in progress.
 *            Communication cannot be guaranteed if the function is called when communication is in progress.
 * @note      The state of the slave device select pin after this function is called is different from its state after
 *            a reset (general input port state). Review the pin settings if necessary.\n
 *            Before calling this user API function, it is recommended that R_FLASH_SPI_Polling() be used to confirm
 *            that the serial flash memory write cycle has completed. This makes it possible to restart serial flash
 *            memory control because the serial flash memory has not transitioned to the write cycle.
 */
flash_spi_status_t R_FLASH_SPI_Close(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

