HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
    ret = r_flash_spi_reset_port(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Close
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Status
 *****************************************************************************************************************/ /**
 * @brief This function is used to read the status register.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_status
 *             Status register storage buffer (size: 1 byte)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Reads the status register and stores the contents in p_status. See section R_FLASH_SPI_Read_Status()
 *            in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_Status(uint8_t devno, uint8_t * p_status)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_status(devno, p_status);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Status
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Status2
 *****************************************************************************************************************/ /**
 * @brief This function is used to read the status register 2. It is a dedicated API function for AT25QF family
 *        serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_status
 *             Status register 2 storage buffer (size: 1 byte)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Reads the status register and stores the contents in p_status. See section R_FLASH_SPI_Read_Status2()
 *            in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_Status2(uint8_t devno, uint8_t * p_status)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_status2(devno, p_status);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Status2
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Status3
 *****************************************************************************************************************/ /**
 * @brief This function is used to read the status register 3. It is a dedicated API function for AT25QF family
 *        serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_status
 *             Status register 3 storage buffer (size: 1 byte)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Reads the status register and stores the contents in p_status. See section R_FLASH_SPI_Read_Status3()
 *            in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_Status3(uint8_t devno, uint8_t * p_status)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_status3(devno, p_status);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Status3
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Set_Write_Protect
 *****************************************************************************************************************/ /**
 * @brief This function is used to make write protect settings.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] wpsts
 *             Write protect setting data
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_WP     Write-protection error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Make write protect settings. SRWD is cleared to 0. See section R_FLASH_SPI_Set_Write_Protect() in the
 *            application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Set_Write_Protect(uint8_t devno, uint8_t wpsts)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

