HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
    ret = r_flash_spi_set_write_protect(devno, wpsts);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Set_Write_Protect
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Di
 *****************************************************************************************************************/ /**
 * @brief This function is used to disable write operation.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Transmits the WRDI command and clears the WEL bit in the status register.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Di(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_write_di(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Di
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Data
 *****************************************************************************************************************/ /**
 * @brief This function is used to read data from the serial flash memory.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_flash_spi_info
 *             Serial flash memory information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_Read_Data() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Reads the specified number of bytes of data from the specified address in the serial flash memory and
 *            stores the data in p_data.\n
 *            The maximum read address is the serial flash memory capacity - 1.\n
 *            Rollover read operations are not supported. After the end address is read, processing ends.
 *            It is then necessary to reset the address and call this API function again.\n
 *            FLASH_SPI_ERR_PARAM is returned if the total value of the read byte count, cnt, and specified address,
 *            addr, exceeds the maximum read address.\n
 *            DMAC transfer or DTC transfer occurs when the transfer size conditions of the clock synchronous single
 *            master control software are matched. Otherwise, operation switches to software transfer.
 * @note      To speed up data transfers, align the start address with a 4-byte boundary when specifying data storage
 *            buffer pointers.\n
 *            The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_Data(uint8_t devno, flash_spi_info_t * p_flash_spi_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_data(devno, p_flash_spi_info);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Data
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Data_Page
 *****************************************************************************************************************/ /**
 * @brief This function is used to write data to the serial flash memory in single-page units.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_flash_spi_info
 *             Serial flash memory information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_Write_Data_Page() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Writes the specified number of bytes of data (up to a maximum size of 1 page) in p_data to the serial
 *            flash memory, starting from the specified address.\n
 *            When writing a large volume of data, communication is divided into page units. This prevents a situation
 *            in which other processing is not possible while communication is in progress. \n
 *            Writing to the serial flash memory is only possible when write protect has been canceled.\n
 *            It is not possible to write to a protected page. Attempting to do so returns the error FLASH_SPI_ERR_WP.\n
 *            The maximum write address is the serial flash memory capacity - 1.\n
 *            The maximum write byte count (cnt) setting value is the capacity of the serial flash memory.\n
 *            FLASH_SPI_ERR_PARAM is returned if the total value of the write byte count, cnt, and specified address,
 *            addr, exceeds the maximum write address.\n
 *            DMAC transfer or DTC transfer occurs when the transfer size conditions of the clock synchronous single
 *            master control software are matched. Otherwise, operation switches to software transfer.\n
 *            When a byte count exceeding 1 page is specified, the remaining byte count and next address information
 *            remain in the serial flash memory information structure (p_flash_info) after processing of a single page
 *            write finishes. It is possible to write the remaining bytes by specifying p_flash_info unmodified in
 *            this API function again.\n
 *            After this user API function finishes successfully, the serial flash memory transitions to the write
 *            cycle. Do not fail to confirm that the write has finished with R_FLASH_SPI_Polling(). If an attempt
 *            is made to perform the next read or write processing while a write cycle is in progress, the serial
 *            flash memory will not accept that processing. \n
 *            R_FLASH_SPI_Polling() can be called at any time specified by the user. This makes it possible for the
 *            user application to perform other processing while a write cycle is in progress.\n
 *            See section R_FLASH_SPI_Write_Data_Page() in the application note for details.
 * @note      To speed up data transfers, align the start address with a 4-byte boundary when specifying data storage
 *            buffer pointers.\n
 *            The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Data_Page(uint8_t devno, flash_spi_info_t * p_flash_spi_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

