HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
    ret = r_flash_spi_write_data_page(devno, p_flash_spi_info);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Data_Page
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Erase
 *****************************************************************************************************************/ /**
 * @brief Based on the mode setting, this function erases all the data in the specified sector (sector erase),
          all the data in the specified block (block erase: 32 KB block or 64 KB block), or all the data on
          the specified chip (chip erase).
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_flash_spi_erase_info
 *             Serial flash memory erase information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_Erase() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   For sector erase, specify the start address of the sector in addr.\n
 *            For block erase, specify the start address of the block in addr.\n
 *            For security erase, specify the start address of the security register pages in addr.\n
 *            For chip erase, set addr to 0x00000000.\n
 *            Erasing data in serial flash memory is only possible when write protect has been canceled. \n
 *            It is not possible to erase data in a protected area. Attempting to do so returns the error
 *            FLASH_SPI_ERR_OTHER.\n
 *            When this user API function completes successfully, the serial flash memory transitions to an erase
 *            cycle. Do not fail to confirm erase completion with R_FLASH_SPI_Polling(). If the next read or write
 *            processing starts when a previous erase cycle is in progress, the serial flash memory will not accept
 *            the new processing. \n
 *            R_FLASH_SPI_Polling() can be called at any time specified by the user. This allows a user application
 *            to perform other processing while an erase cycle is in progress. \n
 *            See section R_FLASH_SPI_Erase() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Erase(uint8_t devno, flash_spi_erase_info_t * p_flash_spi_erase_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_erase(devno, p_flash_spi_erase_info);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Erase
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Polling
 *****************************************************************************************************************/ /**
 * @brief This function is used to perform polling to determine if a write or erase operation has finished.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] mode
 *             Completion wait processing setting. See section R_FLASH_SPI_Polling() in the application note for
 *             details.
 * @retval    FLASH_SPI_SUCCESS         Normal end, and write finished
 * @retval    FLASH_SPI_SUCCESS_BUSY    Normal end, and write in progress
 * @retval    FLASH_SPI_ERR_PARAM       Parameter error
 * @retval    FLASH_SPI_ERR_HARD        Hardware error
 * @retval    FLASH_SPI_ERR_OTHER       Other task has acquired clock synchronous single master control software
 *                                      resources, or other error
 * @details   Determines whether or not a write or erase operation has finished.
 * @note      R_FLASH_SPI_Polling() can be called at any time specified by the user. This makes it possible for the
 *            user application to perform other processing while a write cycle is in progress.\n
 *            The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Polling(uint8_t devno, flash_spi_poll_mode_t mode)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_polling(devno, mode);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Polling
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_ID
 *****************************************************************************************************************/ /**
 * @brief This function is used to read ID information.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_data
 *             ID information storage buffer. The size differs depending on the serial flash memory product used.
 *             See section R_FLASH_SPI_Read_ID() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Stores ID information for the serial flash memory in p_data.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_ID(uint8_t devno, uint8_t * p_data)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_id(devno, p_data);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_ID
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_GetMemoryInfo
 *****************************************************************************************************************/ /**
 * @brief This function is used to fetch the serial flash memory size information.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_flash_spi_mem_info
 *             Serial flash memory size information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_GetMemoryInfo() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @details   Fetches serial flash memory size information for the device number specified by the argument devno.
 * @note      None.
 */
flash_spi_status_t R_FLASH_SPI_GetMemoryInfo(uint8_t devno, flash_spi_mem_info_t * p_flash_spi_mem_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

