HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
    ret = r_flash_spi_get_memory_info(devno, p_flash_spi_mem_info);
    
    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_GetMemoryInfo
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Configuration
 *****************************************************************************************************************/ /**
 * @brief This function is used to read the configuration register(s). It is a dedicated API function for MX25L,
 *        MX66L, MX25R, or MX25U family serial NOR flash memory of Macronix International Co., Ltd.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_config
 *             Configuration register storage buffer. The size differs depending on the serial NOR flash memory
 *             product used. See section R_FLASH_SPI_Read_Configuration() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   Reads the configuration register(s) of the serial NOR Flash memory and stores the contents in p_config.
 *            See section R_FLASH_SPI_Read_Configuration() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_Configuration(uint8_t devno, uint8_t * p_config)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_configuration(devno, p_config);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Configuration
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Configuration
 *****************************************************************************************************************/ /**
 * @brief This function is used to write the configuration register(s). It is a dedicated API function for MX25L,
 *        MX66L, MX25R, or MX25U family serial NOR flash memory of Macronix International Co., Ltd.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_reg
 *             Register information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_Write_Configuration() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   The values set in p_reg->config1 and p_reg->config2 are written to the configuration register.
 *            See section R_FLASH_SPI_Write_Configuration() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Configuration(uint8_t devno, flash_spi_reg_info_t * p_reg)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_write_configuration(devno, p_reg);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Configuration
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Status
 *****************************************************************************************************************/ /**
 * @brief This function is used to write the status register 1. It is a dedicated API function for AT25QF family
 *        serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_reg
 *             Status register 1 setting data buffer
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   The values set in p_reg is written to the status register 1.
 *            See section R_FLASH_SPI_Write_Status() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Status(uint8_t devno, uint8_t * p_reg)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_write_status(devno, p_reg);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Status
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Status2
 *****************************************************************************************************************/ /**
 * @brief This function is used to write the status register 2. It is a dedicated API function for AT25QF family
 *        serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_reg
 *             Status register 2 setting data buffer
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   The values set in p_reg is written to the status register 2.
 *            See section R_FLASH_SPI_Write_Status2() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Status2(uint8_t devno, uint8_t * p_reg)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

