HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
    ret = r_flash_spi_write_status2(devno, p_reg);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Status2
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Status3
 *****************************************************************************************************************/ /**
 * @brief This function is used to write the status register 3. It is a dedicated API function for AT25QF family
 *        serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_reg
 *             Status register 3 setting data buffer
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   The values set in p_reg is written to the status register 3.
 *            See section R_FLASH_SPI_Write_Status3() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Status3(uint8_t devno, uint8_t * p_reg)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_write_status3(devno, p_reg);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Status3
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Set_4byte_Address_Mode
 *****************************************************************************************************************/ /**
 * @brief This function is used to set the address mode to 4-byte address mode. It is a dedicated API function for
 *        MX25L, MX66L, or MX25R family serial NOR flash memory of Macronix International Co., Ltd.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   See section R_FLASH_SPI_Set_4byte_Address_Mode() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Set_4byte_Address_Mode(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_set_4byte_address_mode(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Set_4byte_Address_Mode
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Security
 *****************************************************************************************************************/ /**
 * @brief This function is used to read the security register. It is a dedicated API function for MX25L, MX66L,
 *        MX25R, or MX25U family serial NOR flash memory of Macronix International Co., Ltd.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_scur
 *             Security register  storage buffer (size: 1 byte)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   Reads the security register and stores the contents in p_scur.
 *            See section R_FLASH_SPI_Read_Security() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Read_Security(uint8_t devno, uint8_t * p_scur)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_read_security(devno, p_scur);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Security
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Read_Data_Security_Page
 *****************************************************************************************************************/ /**
 * @brief This function is used to read data from the security register. It is a dedicated API function for AT25QF
 *        family serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in,out] p_flash_spi_info
 *             Serial flash memory information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_Read_Data_Security_Page() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Reads the specified number of bytes of data from the specified address in the security register and
 *            stores the data in p_data.\n
 *            The maximum read address is the page size - 1.\n
 *            Rollover read operations are not supported. After the end address is read, processing ends.
 *            It is then necessary to reset the address and call this API function again.\n
 *            FLASH_SPI_ERR_PARAM is returned if the total value of the read byte count, cnt, and specified address,
 *            addr, exceeds the maximum read address.\n
 *            DMAC transfer or DTC transfer occurs when the transfer size conditions of the clock synchronous single
 *            master control software are matched. Otherwise, operation switches to software transfer.
 * @note      To speed up data transfers, align the start address with a 4-byte boundary when specifying data storage
 *            buffer pointers.\n
 *            The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.\n
 *            This API function is omitted in QSPIX Memory Mapped Mode.
 */
flash_spi_status_t R_FLASH_SPI_Read_Data_Security_Page(uint8_t devno,  flash_spi_info_t * p_flash_spi_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

