HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
    ret = r_flash_spi_read_data_security_page(devno, p_flash_spi_info);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Read_Data_Security_Page
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Write_Data_Security_Page
 *****************************************************************************************************************/ /**
 * @brief This function is used to write data to the security register page in single-page units. It is a dedicated
 *        API function for AT25QF family serial NOR flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] p_flash_spi_info
 *             Serial flash memory information structure. Use a structure address aligned with a 4-byte boundary.
 *             See section R_FLASH_SPI_Write_Data_Security_Page() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *                                 or other error
 * @details   Writes the specified number of bytes of data (up to a maximum size of 1 page) in p_data to the security
 *            register pages, starting from the specified address.\n
 *            When writing a large volume of data, communication is divided into page units. This prevents a situation
 *            in which other processing is not possible while communication is in progress. \n
 *            Writing to the security register pages is only possible when they are not locked.\n
 *            It is not possible to write to a locked page. Attempting to do so returns the error FLASH_SPI_ERR_WP.\n
 *            The maximum write byte count (cnt) setting value is the capacity of the security register page size.\n
 *            FLASH_SPI_ERR_PARAM is returned if the total value of the write byte count, cnt, and specified address,
 *            addr, exceeds the maximum write address.\n
 *            DMAC transfer or DTC transfer occurs when the transfer size conditions of the clock synchronous single
 *            master control software are matched. Otherwise, operation switches to software transfer.\n
 * @note      To speed up data transfers, align the start address with a 4-byte boundary when specifying data storage
 *            buffer pointers.\n
 *            The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Write_Data_Security_Page(uint8_t devno, flash_spi_info_t * p_flash_spi_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_write_data_security_page(devno, p_flash_spi_info);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Write_Data_Security_Page
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Quad_Enable
 *****************************************************************************************************************/ /**
 * @brief This function is used to enable quad mode. It is a dedicated API function for MX25L, MX66L, MX25R,
 *        or MX25U family serial NOR flash memory of Macronix International Co., Ltd and AT25QF family serial NOR
 *        flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   Sets the quad enable (QE) bit in the status register to 1 to enable quad mode.\n
 *            To use quad mode, first call this function.\n
 *            After processing finishes, read the status register to confirm that the value of the QE bit is 1.\n
 *            The quad enable (QE) bit is a non-volatile bit. Once quad mode has been enabled, it is necessary to
 *            run R_FLASH_SPI_Quad_Disable() to disable quad mode.\n
 *            When this user API function completes successfully, the serial flash memory transitions to a write
 *            cycle. Do not fail to confirm write completion with R_FLASH_SPI_Polling(). If the next read or write
 *            processing starts when a previous write cycle is in progress, the serial flash memory will not accept
 *            the new processing. \n
 *            R_FLASH_SPI_Polling() can be called at any time specified by the user. This allows a user application
 *            to perform other processing while a write cycle is in progress. \n
 *            See section R_FLASH_SPI_Quad_Enable() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Quad_Enable(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_quad_enable(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Quad_Enable
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Quad_Disable
 *****************************************************************************************************************/ /**
 * @brief This function is used to disable quad mode. It is a dedicated API function for MX25L, MX66L, MX25R,
 *        or MX25U family serial NOR flash memory of Macronix International Co., Ltd.and AT25QF family serial NOR
 *        flash memory of Renesas Electronics.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @retval    FLASH_SPI_ERR_PARAM  Parameter error
 * @retval    FLASH_SPI_ERR_HARD   Hardware error
 * @retval    FLASH_SPI_ERR_OTHER  Other task has acquired clock synchronous single master control software resources,
 *            or other error
 * @details   Clears the quad enable (QE) bit in the status register to 0 to cancel quad mode.\n
 *            After processing finishes, read the status register to confirm that the value of the QE bit is 0.\n
 *            The quad enable (QE) bit is a non-volatile bit. Once quad mode has been enabled, it is necessary to
 *            run this user API function to disable quad mode.\n
 *            When this user API function completes successfully, the serial flash memory transitions to a write
 *            cycle. Do not fail to confirm write completion with R_FLASH_SPI_Polling(). If the next read or write
 *            processing starts when a previous write cycle is in progress, the serial flash memory will not accept
 *            the new processing. \n
 *            R_FLASH_SPI_Polling() can be called at any time specified by the user. This allows a user application
 *            to perform other processing while a write cycle is in progress. \n
 *            See section R_FLASH_SPI_Quad_Disable() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Quad_Disable(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_quad_disable(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Quad_Disable
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_GetVersion
 *****************************************************************************************************************/ /**
 * @brief This function is used to fetch the serial flash memory version information.
 * @return    Version number.   Upper 2 bytes: major version, lower 2 bytes: minor version.
 * @details   Returns the version information.
 * @note      None
 */
uint32_t R_FLASH_SPI_GetVersion(void)
{
    uint32_t const version = (FLASH_SPI_VERSION_MAJOR << 16) | FLASH_SPI_VERSION_MINOR;
    
    return version;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_GetVersion
 *********************************************************************************************************************/


/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_1ms_Interval
 *****************************************************************************************************************/ /**
 * @brief This function calls the interval timer counter function of the clock synchronous single master control
 *        software. When using the DMAC or DTC, use a timer to call this function at 1 ms intervals.
 * @details   Increments the internal timer counter of the clock synchronous single master control software while
 *            waiting for the DMAC transfer or DTC transfer to finish.
 * @note      User a timer or the like to call this function at 1 ms intervals.
 */
void R_FLASH_SPI_1ms_Interval(void)
{
    r_flash_spi_drvif_1ms_interval();
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_1ms_Interval
 *********************************************************************************************************************/


