HirokiIshiguro/rx72n-envision-kit/Projects/aws_ether_rx72n_envision_kit/e2studio_ccrx/src/smc_gen/r_flash_spi/src/r_flash_spi.c
#if (FLASH_SPI_CFG_LONGQ_ENABLE == 1)
/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Set_LogHdlAddress
 *****************************************************************************************************************/ /**
 * @brief This function specifies the handler address for the LONGQ FIT module. Call this function when using error
 *        log acquisition processing.
 * @param[in] user_long_que
 *             Specify the handler address of the LONGQ FIT module.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @details   Sets the handler address of the LONGQ FIT module in the serial flash memory control software and the
 *            clock synchronous single master control software used by the specified device.\n
 *            This is preparatory processing to enable fetching of error logs using the LONGQ FIT module.
 *            Run this function before calling R_FLASH_SPI_Open().
 * @note      Add the LONGQ FIT module, which is available separately, to your project.\n
 *            Enable the macro FLASH_SPI_CFG_LONGQ_ENABLE in r_flash_spi_config.h. Also, enable
 *            macro xxx_LONGQ_ENABLE in the clock synchronous single master control software used by the
 *            specified device.\n
 *            In the LONGQ FIT module, set the ignore_overflow argument of R_LONGQ_Open() to 1.
 *            This allows the error log buffer to be used as a ring buffer.
 */
flash_spi_status_t R_FLASH_SPI_Set_LogHdlAddress(uint32_t user_long_que)
{
    p_flash_long_que = (longq_hdl_t)user_long_que;
    r_flash_spi_drvif_set_loghdladdress(user_long_que);
    return FLASH_SPI_SUCCESS;
}


/************************************************************************************************
* Function Name: r_flash_spi_log
* Description  : Stores error information to LONGQ buffer.
* Arguments    : uint32_t           flg                 ;   Breakpoint processing
*              : uint32_t           fid                 ;   Flash middleware file No.
*              : uint32_t           line                ;   Flash middleware line No.
* Return Value : 0                                      ;   Successful operation
*              : 1                                      ;   Error
*------------------------------------------------------------------------------------------------
* Notes        : None
*************************************************************************************************/
uint32_t r_flash_spi_log(uint32_t flg, uint32_t fid, uint32_t line)
{
    longq_err_t err = LONGQ_SUCCESS;
    uint32_t    ul_tmp = 0;

    /* Long to Byte */
    ul_tmp = 0;                                         /* Reserved               */
    ul_tmp = (ul_tmp | (line << 8));                    /* LINE                   */
    ul_tmp = (ul_tmp | (fid  << 21));                   /* FID FILE No.           */
    ul_tmp = (ul_tmp | (FLASH_SPI_DRIVER_ID << 27));    /* FID DRIVER No.         */
    ul_tmp = (ul_tmp | (flg  << 31));                   /* Breakpoint processing  */

    err = R_LONGQ_Put(p_flash_long_que, ul_tmp);
    if (err != LONGQ_SUCCESS)
    {
        return 1;
    }

    /* Breakpoint processing */
    if (0x80000000 == (ul_tmp & 0x80000000))
    {
        return 1;
    }
    return 0;
}
#else  /* (FLASH_SPI_CFG_LONGQ_ENABLE == 1) */
/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Set_LogHdlAddress
 *****************************************************************************************************************/ /**
 * @brief This function specifies the handler address for the LONGQ FIT module. Call this function when using error
 *        log acquisition processing.
 * @param[in] user_long_que
 *             Specify the handler address of the LONGQ FIT module.
 * @retval    FLASH_SPI_SUCCESS    Successful operation
 * @details   Sets the handler address of the LONGQ FIT module in the serial flash memory control software and the
 *            clock synchronous single master control software used by the specified device.\n
 *            This is preparatory processing to enable fetching of error logs using the LONGQ FIT module.
 *            Run this function before calling R_FLASH_SPI_Open().
 * @note      Add the LONGQ FIT module, which is available separately, to your project.\n
 *            Enable the macro FLASH_SPI_CFG_LONGQ_ENABLE in r_flash_spi_config.h. Also, enable
 *            macro xxx_LONGQ_ENABLE in the clock synchronous single master control software used by the
 *            specified device.\n
 *            In the LONGQ FIT module, set the ignore_overflow argument of R_LONGQ_Open() to 1.
 *            This allows the error log buffer to be used as a ring buffer.
 */
flash_spi_status_t R_FLASH_SPI_Set_LogHdlAddress(uint32_t user_long_que)
{
    return FLASH_SPI_SUCCESS;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Set_LogHdlAddress
 *********************************************************************************************************************/
#endif  /* (FLASH_SPI_CFG_LONGQ_ENABLE == 1) */


/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Log
 *****************************************************************************************************************/ /**
 * @brief This function fetches the error log. When an error occurs, call this function immediately before user
 *        processing ends.
 * @param[in] flg
 *             Set this to 0x00000001 (fixed value).
 * @param[in] fid
 *             Set this to 0x0000003f (fixed value).
 * @param[in] line
 *             Set this to 0x0001ffff (fixed value).
 * @retval    0    Successful operation
 * @retval    1    Error
 * @details   This function fetches the error log. When an error occurs, call this function immediately before user
 *            processing ends.
 * @note      Incorporate the LONGQ FIT module separately.\n
 *            Enable the macro FLASH_SPI_CFG_LONGQ_ENABLE in r_flash_spi_config.h. Also, enable
 *            macro xxx_LONGQ_ENABLE in the clock synchronous single master control software used by the
 *            specified device.
 */
uint32_t R_FLASH_SPI_Log(uint32_t flg, uint32_t fid, uint32_t line)
{
    R_FLASH_SPI_Log_Func(flg, fid, line);
    return 0;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Log
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Set_Write_Protect_Advanced_Sector
 *****************************************************************************************************************/ /**
 * @brief This function is used to make advanced write-protect settings. It is a dedicated API function for MX66L, 
 *        or MX25U family serial NOR flash memory of Macronix International Co., Ltd.
 * @param[in] devno
 *             Device number (0, 1)
 * @param[in] flash_spi_protect_sector_info
 *             Flash memory advanced sector protection information structure. Use a structure address aligned with
 *             a 4-byte boundary.
 *             See section R_FLASH_SPI_Set_Write_Protect_Advanced_Sector() in the application note for details.
 * @retval    FLASH_SPI_SUCCESS         Successful operation
 * @retval    FLASH_SPI_ERR_PARAM       Parameter error
 * @retval    FLASH_SPI_ERR_HARD        Hardware error
 * @retval    FLASH_SPI_ERR_OTHER       Other task has acquired clock synchronous single master control software resources,
 *                                      or other error
 * @retval    FLASH_SPI_ERR_WP_ADVANCED Advanced write-protection error
 * @details   Make advanced write-protect settings.
 *            See section R_FLASH_SPI_Set_Write_Protect_Advanced_Sector() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Set_Write_Protect_Advanced_Sector(uint8_t devno, flash_spi_protect_sector_info_t * flash_spi_protect_sector_info)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_set_write_protect_advanced_sector(devno, flash_spi_protect_sector_info);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Set_Write_Protect_Advanced_Sector
 *********************************************************************************************************************/

/**********************************************************************************************************************
 * Function Name: R_FLASH_SPI_Erase_Write_Protect_Advanced_Sector
 *****************************************************************************************************************/ /**
 * @brief This function is used to erase all advanced write-protect settings. It is a dedicated API function for MX66L, 
 *        or MX25U family serial NOR flash memory of Macronix International Co., Ltd.
 * @param[in] devno
 *             Device number (0, 1)
 * @retval    FLASH_SPI_SUCCESS         Successful operation
 * @retval    FLASH_SPI_ERR_PARAM       Parameter error
 * @retval    FLASH_SPI_ERR_HARD        Hardware error
 * @retval    FLASH_SPI_ERR_OTHER       Other task has acquired clock synchronous single master control software resources,
 *                                      or other error
 * @retval    FLASH_SPI_ERR_WP_ADVANCED Advanced write-protection error
 * @details   Erase all advanced write-protect settings.
 *            See section R_FLASH_SPI_Erase_Write_Protect_Advanced_Sector() in the application note for details.
 * @note      The clock synchronous single master control software resources are acquired at the start of the
 *            processing, and the resources are released and the end of the processing.
 */
flash_spi_status_t R_FLASH_SPI_Erase_Write_Protect_Advanced_Sector(uint8_t devno)
{
    flash_spi_status_t ret = FLASH_SPI_SUCCESS;

    ret = r_flash_spi_erase_write_protect_advanced_sector(devno);

    return ret;
}
/**********************************************************************************************************************
 End of function R_FLASH_SPI_Erase_Write_Protect_Advanced_Sector
 *********************************************************************************************************************/


/* End of File */
